examples/mock-requests/pix-add-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:hl7="urn:hl7-org:v3">
  <soap:Header/>
  <soap:Body>
    <hl7:PRPA_IN201301UV02 ITSVersion="XML_1.0">
      <!-- Message ID -->
      <hl7:id root="2.16.840.1.113883.3.72.5.9.1" extension="MSGID123456"/>
      <hl7:creationTime value="20250108150000"/>
      <hl7:interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201301UV02"/>
      <hl7:processingCode code="P"/>
      <hl7:processingModeCode code="T"/>
      <hl7:acceptAckCode code="AL"/>
      
      <!-- Receiver: PIX Manager -->
      <hl7:receiver typeCode="RCV">
        <hl7:device classCode="DEV" determinerCode="INSTANCE">
          <hl7:id root="2.16.840.1.113883.3.72.5.9.2"/>
          <hl7:name>PIX_MANAGER</hl7:name>
        </hl7:device>
      </hl7:receiver>
      
      <!-- Sender: Patient Identity Source -->
      <hl7:sender typeCode="SND">
        <hl7:device classCode="DEV" determinerCode="INSTANCE">
          <hl7:id root="2.16.840.1.113883.3.72.5.9.3"/>
          <hl7:name>PATIENT_IDENTITY_SOURCE</hl7:name>
        </hl7:device>
      </hl7:sender>
      
      <!-- Control Act Process -->
      <hl7:controlActProcess classCode="CACT" moodCode="EVN">
        <hl7:code code="PRPA_TE201301UV02" codeSystem="2.16.840.1.113883.1.6"/>
        
        <!-- Subject: Patient Registration Event -->
        <hl7:subject typeCode="SUBJ">
          <hl7:registrationEvent classCode="REG" moodCode="EVN">
            <hl7:id nullFlavor="NA"/>
            <hl7:statusCode code="active"/>
            
            <!-- Subject1: Patient -->
            <hl7:subject1 typeCode="SBJ">
              <hl7:patient classCode="PAT">
                <!-- Patient ID -->
                <hl7:id root="1.2.3.4.5" extension="PAT12345"/>
                <hl7:statusCode code="active"/>
                
                <!-- Patient Person -->
                <hl7:patientPerson classCode="PSN" determinerCode="INSTANCE">
                  <!-- Name -->
                  <hl7:name>
                    <hl7:given>John</hl7:given>
                    <hl7:family>Doe</hl7:family>
                  </hl7:name>
                  
                  <!-- Gender -->
                  <hl7:administrativeGenderCode code="M"/>
                  
                  <!-- Birth Date -->
                  <hl7:birthTime value="19800101"/>
                  
                  <!-- Address -->
                  <hl7:addr use="HP">
                    <hl7:streetAddressLine>123 Main Street</hl7:streetAddressLine>
                    <hl7:city>Springfield</hl7:city>
                    <hl7:state>IL</hl7:state>
                    <hl7:postalCode>62701</hl7:postalCode>
                    <hl7:country>USA</hl7:country>
                  </hl7:addr>
                  
                  <!-- Telecom -->
                  <hl7:telecom use="HP" value="tel:+1-555-123-4567"/>
                </hl7:patientPerson>
                
                <!-- Provider Organization -->
                <hl7:providerOrganization classCode="ORG" determinerCode="INSTANCE">
                  <hl7:id root="2.16.840.1.113883.3.72.5.9.4"/>
                  <hl7:name>Sample Healthcare Organization</hl7:name>
                </hl7:providerOrganization>
              </hl7:patient>
            </hl7:subject1>
            
            <!-- Custodian -->
            <hl7:custodian typeCode="CST">
              <hl7:assignedEntity classCode="ASSIGNED">
                <hl7:id root="2.16.840.1.113883.3.72.5.9.4"/>
              </hl7:assignedEntity>
            </hl7:custodian>
          </hl7:registrationEvent>
        </hl7:subject>
      </hl7:controlActProcess>
    </hl7:PRPA_IN201301UV02>
  </soap:Body>
</soap:Envelope>
