app/controllers/PIXPatientRegistryRecordAddedRequestSoapEnv.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ser="http://serviceimpl.pixpdq.services.hieos.vangent.com">
   <soap:Header/>
   <soap:Body>
      <PRPA_IN201301UV02 xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201301UV02.xsd" ITSVersion="XML_1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3">
         <id root="22a0f9e0-4454-11dc-a6be-3603d6866807"/>
         <creationTime value="20070803130624"/>
         <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201301UV02"/>
         <processingCode code="P"/>
         <processingModeCode code="R"/>
         <acceptAckCode code="AL"/>
         <receiver typeCode="RCV">
            <device classCode="DEV" determinerCode="INSTANCE">
               <id root="1.2.840.114350.1.13.99999.4567"/>
               <telecom value="https://example.org/PatientFeed"/>
            </device>
         </receiver>
         <sender typeCode="SND">
            <device classCode="DEV" determinerCode="INSTANCE">
               <id root="1.2.840.114350.1.13.99998.8734"/>
	       <name>FOOBAR</name>
	       <telecom value="https://www.foo.com"/>
            </device>
         </sender>
         <controlActProcess classCode="CACT" moodCode="EVN">
            <subject typeCode="SUBJ">
               <registrationEvent classCode="REG" moodCode="EVN">
                  <id nullFlavor="NA"/>
                  <statusCode code="active"/>
                  <subject1 typeCode="SBJ">
                     <patient classCode="PAT">
                        <id root="1.3.6.1.4.1.21367.13.20.9999" extension="TEST_999_11"/>
                        <statusCode code="active"/>
                        <patientPerson>
                           <name>
                              <given>Bernie</given>
                              <family>Thuman</family>
                           </name>
                           <administrativeGenderCode code="M"/>
                        </patientPerson>
                        <providerOrganization classCode="ORG" determinerCode="INSTANCE">
                           <id root="1.2.840.114350.1.13.99998.8734"/>
                           <name>Good Health Clinic</name>
                           <contactParty classCode="CON">
                              <telecom value="tel:+1-342-555-8394"/>
                           </contactParty>
                        </providerOrganization>
                     </patient>
                  </subject1>
                  <custodian typeCode="CST">
                     <assignedEntity classCode="ASSIGNED">
                        <id root="1.2.840.114350.1.13.99998.8734"/>
                        <assignedOrganization classCode="ORG" determinerCode="INSTANCE">
                           <name>Good Health Clinic</name>
                        </assignedOrganization>
                     </assignedEntity>
                  </custodian>
               </registrationEvent>
            </subject>
         </controlActProcess>
      </PRPA_IN201301UV02>
   </soap:Body>
</soap:Envelope>